Repository: KC-2001MS/Navajo-Swift
Catalog: Sources/Navajo-Swift/Localizable.xcstrings
Source language: en
Languages: ja, ko

# NAVAJO_ALLOWED_CHARACTER_ERROR
source: Must not include disallowed character
ja: 許可されていない文字を含まないこと
ko: 허용된 문자만 사용해야 합니다

# NAVAJO_BLOCK_ERROR
source: Must not satisfy precondition
ja: 条件を満たしていません
ko: Block에서 true가 반환되면 안됩니다

# NAVAJO_DICTIONARYWORD_ERROR
source: Must not be dictionary word
ja: 辞書に載っている単語を使わないこと
ko: 사전에 포함된 문자를 사용하면 안됩니다

# NAVAJO_LENGTH_ERROR
source: Must be within range
ja: 文字数の範囲を超えないこと
ko: 길이가 다음 범위안에 있어야 합니다

# NAVAJO_PREDICATE_ERROR
source: Must not match predicate
ja: 述語と一致しないこと
ko: Predicate에 매칭되면 안됩니다

# NAVAJO_REASONABLE
source: Reasonable
ja: 適度
ko: 적당함

# NAVAJO_REGEX_ERROR
source: Must not match regular expression
ja: 正規表現にマッチしないこと
ko: Regex에 매칭되면 안됩니다

# NAVAJO_REQUIRED_CHARACTER_DECIMAL_DIGIT_ERROR
source: Must include decimal digit characters
ja: アラビア数字を含むこと
ko: 숫자를 포함해야 합니다

# NAVAJO_REQUIRED_CHARACTER_LOWERCASE_ERROR
source: Must include lowercase characters
ja: 英字の小文字を含むこと
ko: 소문자를 포함해야 합니다

# NAVAJO_REQUIRED_CHARACTER_REQUIRED_ERROR
source: Must include required characters
ja: 必須文字を含むこと
ko: 요구되는 문자를 포함해야 합니다

# NAVAJO_REQUIRED_CHARACTER_SYMBOL_ERROR
source: Must include symbol characters
ja: 記号文字を含むこと
ko: 심볼을 포함해야 합니다

# NAVAJO_REQUIRED_CHARACTER_UPPERCASE_ERROR
source: Must include uppercase characters
ja: 英字の大文字を含むこと
ko: 대문자를 포함해야 합니다

# NAVAJO_STRONG
source: Strong
ja: 強い
ko: 강함

# NAVAJO_VERY_STRONG
source: Very Strong
ja: とても強い
ko: 매우 강함

# NAVAJO_VERY_WEAK
source: Very Weak
ja: とても弱い
ko: 매우 약함

# NAVAJO_WEAK
source: Weak
ja: 弱い
ko: 약함
